Revit 2026 API

# GroupSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public GroupSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
GroupSetIterator()
```
```fsharp
new : unit -> GroupSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

GroupSetIterator Class

Autodesk.Revit.DB Namespace